const licenseStr = '''
## 用户协议

欢迎使用gptchat人工智能助手软件。在使用本软件之前，请您认真阅读并理解本协议的全部内容。本协议是您与gptchat之间关于gptchat软件使用的法律协议。如果您不同意本协议的任何条款，请勿使用本软件。如果您使用本软件，则视为您已完全同意并接受本协议的所有条款。

### 一、软件许可使用

本软件的所有权、知识产权及相关权利均归属于gptchat团队所有。在您同意并遵守本协议的前提下， gptchat授予您一项非排他性的、不可转让的、有限制的许可，以使用本软件。您只能在符合本协议所规定的条件下使用本软件。

### 二、用户使用规定

1. 您在使用本软件时，应当遵守中华人民共和国的相关法律法规和本协议项下的规定。您应当使用本软件进行合法合规的活动，并且不得利用本软件从事任何违法违规行为。
2. 您应当妥善保管本软件的账户名称和密码，不得将其转让或授权给他人使用。如发现账户遭到非法使用或者有安全问题，请立即通知gptchat团队。
3. 您在使用本软件时，不得以任何形式侵犯他人的合法权益。
4. 不得生成仇恨、骚扰或暴力内容：包括但不限于：基于身份表达、煽动或宣扬仇恨的内容;意图骚扰、威胁或欺凌个人的内容;宣扬或美化暴力或歌颂他人遭受苦难或羞辱的内容。
5. 不得用在恶意软件生成：试图生成旨在破坏、损坏或未经授权访问计算机系统的代码的内容。
6. 不得用于欺诈或欺骗活动：包括但不限于：诈骗，学术欺骗，欺诈性的广告，以及试图欺骗或欺骗他人的内容。
7. 不得用于成人内容、成人行业和约会应用：包括但不限于：旨在引起性兴奋的内容，例如对性活动的描述，或宣传性服务的内容（不包括性教育和健康; 色情聊天; 色情。
8. 不得用于未经合格人员审查而未经授权从事法律工作或提供量身定制的法律建议。
9. 不得在没有合格人员审查的情况下提供量身定制的理财建议。
10. 不得用于医疗场景诊断某种健康状况，或提供治疗说明。


### 三、免责声明

1. 您应当明确知晓并同意，本软件无法保证服务不中断，也无法保证服务的安全性、完整性以及可靠性。对于因网络状况、通讯线路、电脑故障、系统不稳定、人为操作疏忽等各种原因而导致的服务中断、数据丢失、信息的缺失等，gptchat团队不承担任何责任。

2. 对于因使用本软件所接触到的第三方资源信息，gptchat团队无法进行保证其真实性、准确性、可信度、完整性以及合法性等，不承担任何责任。您在使用本软件时，应该自行判断并承担使用第三方资源信息的风险。

### 四、协议变更

gptchat团队拥有随时修改本协议的权利。修改后的协议一经公布，立即代替原协议。如果您不同意修改后的协议，请立即停止使用本软件；如果您继续使用本软件，则视为您已同意修改后的协议。

### 五、其他条款

1. 本协议适用中华人民共和国的法律，并且在中国大陆地区生效。

2. 如果本协议的任何内容因与中华人民共和国法律相抵触而导致该条款无效，则该条款将被视为无效，但其他条款的效力不受影响。

3. 如果您违反了本协议的任何规定，gptchat团队有权利终止您的软件许可使用，并承担有关法律责任。


''';
